# Fonts
cask 'font-hack-nerd-font'

# Applications
cask 'iterm2'
cask 'podman-desktop'
cask 'google-chrome'
cask '1password'
cask '1password-cli'

# Containers
brew 'podman-compose'

# Git & GitHub
brew 'gh'
brew 'delta'        # Better git diffs with syntax highlighting

# Shell & Navigation
brew 'zplug'
brew 'direnv'
brew 'fzf'
brew 'zoxide'

# Modern CLI replacements
brew 'bat'
brew 'eza'
brew 'ripgrep'

# Terminal Multiplexing
brew 'tmux'
brew 'tmuxinator'
brew 'lynx'

# Editors
brew 'neovim'

# Node.js
brew 'nvm'
brew 'pnpm'

# Lua
brew 'lua'
brew 'luarocks'
brew 'selene'
brew 'stylua'

# Java
brew 'java'
brew 'gradle'

# Go
brew 'go'
brew 'gopls'

# Linting & Quality
brew 'codespell'
brew 'vale'
brew 'yamllint'

# Data Processing
brew 'jq'
