cask_args appdir: '/Applications'

cask 'font-hack-nerd-font'
cask 'iterm2'
cask 'podman-desktop'
cask 'google-chrome'
cask '1password'

brew 'fzf'
brew 'zplug'
brew 'ripgrep'

brew 'lynx'
brew 'neovim'
brew 'tmux'
brew 'tmuxinator'

brew 'nvm'
brew 'pnpm'

brew 'lua'
brew 'luarocks'

brew 'java'
brew 'gradle'
