cask 'font-hack-nerd-font'
cask 'iterm2'
cask 'podman-desktop'
cask 'google-chrome'
cask '1password'

brew "direnv"
brew 'fzf'
brew 'ripgrep'
brew 'zplug'

brew 'neovim'
brew 'codespell'
brew 'vale'

brew 'jq'
brew 'yamllint'

brew 'lynx'
brew 'tmux'
brew 'tmuxinator'

brew 'nvm'
brew 'pnpm'

brew 'lua'
brew 'luarocks'
brew 'selene'
brew 'stylua'

brew 'java'
brew 'gradle'
